[{"Title":"Welcome chapter","Language":"english","Author":"test","Description":"This is a test chapter to welcome you to the InterSystems Workshop Organizer and Optimizer Program!","IsPrivate":false,"Pages":[{"Content":"![logo](assets/imgs/InterSystemsWOOPLogo.png){width: 20%}\n\n# Welcome to InterSystems Workshop Organizer and Optimizer Program\n\nThe InterSystems Workshop Organizer and Optimizer Program is a program designed to help you organize and optimize your InterSystems workshop experience. The program is designed to help you get the most out of your workshop experience by providing you with a set of tools and resources to help you organize your workshop experience."},{"Content":"## Create your first workshop\n\nTo create your first workshop, you will need to be logged in. On the homepage you can see a list of all the workshops you have created and a + button to create a new workshop.\n\nThe program will displays you a form to fill in the details of your workshop:\n\n-   **Name**: The name of your workshop.\n-   **Language**: The language of your workshop.\n-   **Password**: The password of your workshop.\n-   **Private**: If enabled the workshop is private and only accessible by you.\n-   **Description**: A short description of your workshop."},{"Content":"## Edit your workshop\n\nTo edit your workshop, you will need to be logged in. On the homepage you can see a list of all the workshops you have created and a edit button to edit your workshop.Clicking on the edit button you will be navigated to the edit page of your workshop."},{"Content":"## Add your first page\n\nWhen you edit a workshop you can add and remove pages. Lets add a page and have a look at a page...\n\nHow you can see, the page is divided in three parts:\n\n-   **Conent**: Here you can write the content of your page. Usually you will create your exercises here.\n-   **Hint**: Here you can write a hint for the exercise.\n-   **Result**: Here you can write the solution of the exercise.","Hint":"## Hint\n\nThis is a Hint.","Result":"## Result\n\nThis is a result."},{"Content":"## Writing pages\n\nPages are written in Markdown. You can find a Markdown cheatsheet by clicking on the _help_ button.\n\nLets take a look at all the features of the Markdown language..."},{"Content":"### Haedings\n\nYou can create headings by adding a `#` in front of your text. The number of `#` defines the level of the heading.","Result":"~~~markdown\n# Heading 1\n## Heading 2\n### Heading 3\n#### Heading 4\n##### Heading 5\n~~~"},{"Content":"### Text\n\nYou can write text as you would do in any other text editor.","Result":"~~~markdown\nThis is a text.\n~~~"},{"Content":"### Styling your text\n\n- Text can be **bold** by adding `**` in front and after your text.\n- Text can be *italic* by adding `*` in front and after your text.\n- Text can be ~~strikethrough~~ by adding `~~` in front and after your text.","Result":"~~~markdown\n**bold**\n*italic*\n~~strikethrough~~\n~~~"},{"Content":"### Unordered Lists\n\nYou can create lists by adding a `-` in front of your text.","Result":"~~~markdown\n- Item 1\n- Item 2\n- Item 3\n~~~"},{"Content":"### Ordered Lists\n\nYou can create ordered lists by adding a number and a `.` in front of your text.","Result":"~~~markdown\n1. Item 1\n2. Item 2\n3. Item 3\n~~~"},{"Content":"### Links\n\nYou can create links by adding `[` and `]` in front and after your text. The first part is the text of the link and the second part is the link itself.","Result":"~~~markdown\n[Link text](https://www.intersystems.com)\n~~~"},{"Content":"### Images\n\nYou can add images by adding `![` and `]` in front and after your text. The first part is the alt text of the image and the second part is the link to the image.","Result":"~~~markdown\n![Alt text](url){css}\n~~~"},{"Content":"### Code Block\n\nYou can add code by adding ` ``` ` in front and after your text. The first part is the language of the code and the second part is the code itself.","Result":"~~~markdown\n```javascript\nconsole.log(\"Hello World!\");\n```\n~~~"},{"Content":"### Code Window\n\nYou can add code by adding ` ~~~ ` in front and after your text. The first part is the language of the code and the second part is the code itself.","Result":"~~~markdown\n ~~~javascript\n console.log(\"Hello World!\");\n ~~~\n~~~"},{"Content":"## Have fun!\n\nNow you can create your own workshops and have fun!"}]},{"Title":"BASICS InterSystems IRIS","Password":"1978ISC","Language":"english","Author":"pbonin","Description":"Development with ObjectScript and advanced concepts","IsPrivate":false,"Pages":[{"Content":"## Introduction\n\nIn the following exercises, you will create a simple data model step by step to implement an\nenterprise resource planning system.\n\nBased on this, data is generated for the model and then various techniques are demonstrated and\npracticed working with the data. Object access as well as the various possibilities with SQL will be\nused to process the data.\n\nAnother role will be the implementation of logic using class and instance methods.\n\nFinally, the different projections (XML, JSON) will be used to implement web services (SOAP and\nREST).\n\nThe practical exercises will be complemented by demos of various other features.\n\n?[FoundationsTraining_IMG1.png](FoundationsTraining_IMG1.png){width:70%}\n\nPart of the model (Training.Article) is already pre-installed."},{"Content":"## Infrastructure\n\nYou work with a private VM in the cloud. Windows 10 and InterSystems IRIS are installed in the VM.\nVSCode or the IRIS Studio are available as development environments. The examples in the exercises\nhave been created with VSCode, but if you prefer to use IRIS Studio, you are welcome to do so.\n\nYour personal access data to the VM will be sent to you in good time. The VM will then be available\nduring the training days.\n\nIn the following exercises, the above model will now be successively built up and enriched with\nvarious methods.\n\n**It is strongly recommended to use the identifiers as indicated in the exercise script, as the exercises build on each other.**"},{"Content":"## Exercise 1 – Persistent vs. Registered vs. Serial\n\nIn InterSystems IRIS there are different possibilities to define data classes. A distinction is made between:\n\n- **Persistent** : Objects of this type can be stored permanently and have an SQL projection by\n    default.\n- **Registered** : Objects of this type exist only in the memory and are therefore volatile.\n- **Serial** : These objects are embedded in persistent or registered objects and have no identity\n    of their own in the database. If the embedding object is destroyed, the embedded object is\n    also destroyed.\n\n1. Let's start by defining a class for storing the customer in the database. This is a persistent class, because customer objects should be stored permanently and should also be accessible via SQL.\n2. The class should first have the two properties\n\n- a. **CustomerNr %Integer**\n- b. **Name %String**\n\n3. Define for the property **CustomerNr the MINVAL = 1**. Since we want to use the data generator of\nIRIS later, the class should first inherit from **_%Persistent_** and **_%Populate_**.\n\nIt should not be possible to save the customer without specifying a CustomerNr and a Name.\nTherefore we define these two properties as **_required_**.","Hint":"Use this construct:\n\n~~~objectscript\nClass Pkg.ClassName Extends (SuperClass1, SuperClass2)\n{\n\nProperty PropName As Type (Attributes) [ Attributes];\n\n}\n~~~","Result":"~~~objectscript\nClass Training.Customer Extends (%Persistent, %Populate)\n{\n\nProperty CustomerNr As %Integer(MINVAL = 1) [ Required ];\n\nProperty Name As %String [ Required ];\n\n}\n~~~"},{"Content":"In the next step, a serial class is added to the Customer class. This class describes the address of the\ncustomer.\n\nDefine a class Training.Address. The class has the following properties\n\n- a. **City %String**\n- b. **Postcode %Integer**\n- c. **Street %String**\n\nand extends **_%SerialObject_** and **_%Populate_**.\n\nThe operation of the data generator can be controlled by the POPSPEC parameter.\n\n- Specify the POPSPEC parameter for the three properties. The data for the City should be\n    generated with the **_City()_** method. For the Postcode please specify **_USZip()_** and for Street\n    **_Street()._** The resulting class definition looks like this:\n","Hint":"_POPSPEC_ example:\n\n~~~objectscript\n...\nProperty Age As %Integer(POPSPEC = \"Age()\");\n...\n~~~","Result":"~~~objectscript\nClass Training.Address Extends (%SerialObject, %Populate)\n{\n\nProperty City As %String(POPSPEC = \"City()\");\n\nProperty Postcode As %Integer(POPSPEC = \"USZip()\");\n\nProperty Street As %String(POPSPEC = \"Street()\");\n\n}\n~~~"},{"Content":"The next step is to link the customer class and the address class. For this purpose, a property\n**_Address_** of the type **_Training.Address_** is defined in the customer class.\n\nSave and compile the classes. In the next exercise, data will be generated for the customers and the\nSQL projection will be examined.","Result":"~~~objectscript\nClass Training.Customer Extends (%Persistent, %Populate)\n{\n\nProperty CustomerNr As %Integer(MINVAL = 1) [ Required ];\n\nProperty Name As %String [ Required ];\n\nProperty Address As Training.Address;\n\n}\n~~~"},{"Content":"## Exercise 2 – Data generation and first queries\n\n1. To generate the data, open a terminal window from the IRIS Cube's menu in the taskbar.\n2. Switch to the namespace **_Training_** with: **_zn \"TRAINING\"_**\n3. In the namespace **_TRAINING_** enter: **_write ##class(Training.Customer).Populate(100)_**\n4. **_What output do you get?_**\n","Result":"The Populate method calls the data generator. This has been added to the Customer class by extending the %Populate class. The Populate method returns the number of objects/data sets created. In our example, the current parameter 100 indicates that 100 customer objectsshould be created."},{"Content":"5. Check that 100 customers have been created. To do this, start the **_System Management Portal_** and go to **_Explorer_** and then **_SQL._** Make sure that you are in the **_TRAINING_** namespace. Use SQL to count the number of customer datasets.\n6. Display the customer datasets. **_How is the address data displayed?_**","Result":"By their ID."},{"Content":"7. Start the [Class Reference](http://localhost:52773/csp/documatic/%25CSP.Documatic.cls) from the IRIS Cube and change to the namespace **_TRAINING_**.\n8. Search the documentation of your classes\n\nClasses are automatically documented in the Class Reference. This documentation is\ngenerated dynamically when it is called and is therefore always up to date. For the\ndocumentation there is a special form of comments. These are introduced line by line by\nthree slashes.\n\n9. Add comments preceded by `///` to the properties in the customer class.\n10. Save and compile the class and check the result in the Class Reference.\n"},{"Content":"## Exercise 3 – Object access in ObjectScript\n\nIn this exercise you will learn about object access. All persistent objects have a unique ID or OID in the database. This ID is not reassigned by the system even after the object is deleted.\n\nTo interact with persistent objects in InterSystems IRIS, the following methods play an important role.\n\n- **_%New()_** Class method for creating a new in-memory instance of the class\n- **_%OpenId(...)_** Class method for opening objects in the database\n- **_%Save()_** Instance method for saving AND updating objects\n- **_%DeleteId(...)_** Class method for deleting objects from the database"},{"Content":"1. Go to the System Management Portal in the SQL Explorer and execute the statement:\n\n```\nselect * from Training.Customer\n```\n\n2. Look at the **_ID_** column. The IDs assigned by the system are displayed here.\n3. Start a terminal from the IRIS Cube and use one of the existing IDs and open the corresponding object with **`%OpenId(<ID>)`** method.","Result":"```\nTRAINING>set k = ##class(Traing.Customer).OpenId(1)\n```"},{"Content":"```\nTRAINING>set k = ##class(Traing.Customer).OpenId(1)\n```\n\nIf there is an object of the class Training.Customer with the ID = 1 in the database, the variable `k` then contains an object reference to this object in the memory.\n\n4. **_What does the access to the properties of the object look like?_**","Hint":"This object can be accessed using this object reference k and the properties of the object can be accessed using the dot syntax.\n\nThe access can be both read and write.","Result":"```\nTRAINING>write k.Name\nZevon,Paul N.\n```"},{"Content":"5. Change the name of the customer and then save it by calling the **_%Save()_** method for this object\n6. Verify that your changes are also visible via SQL.\n\nThe **_%Save()_** method returns a status code indicating whether the %Save() was successful or not. A status code = 1 indicates successful save and a status code != 1 indicates a failed save attempt.","Result":"```\nTRAINING>set k.Name = \"Smith,John A.\"\nTRAINING>write k.%Save()\n1\n```"},{"Content":"7. Create a new customer at the terminal using the **_%New()_** method and save it to the database","Result":"```\nTRAINING>set newCustomer = ##class(Traing.Customer).%New()\nTRAINING>set newCustomer.Name = \"Taylor,James K.\"\nTRAINING>write newCustomer.%Save()\n1\n```"},{"Content":"## Exercise 4 – A first class method\n\nIn InterSystems IRIS and in ObjectScript there are two types of methods. **Class methods** and **instance methods**. Class methods are often called static methods in other environments and can be used without a concrete object instance, but for this reason of course it cannot access properties within an object. There is at that moment no object to which the method belongs.\n\nInstance methods operate on a concrete object and can accordingly also access properties or other instance methods of this object. The access takes place here with the **`..<Property or method>`** syntax. That is, two consecutive .. followed by the referenced property or method to be called.\n\nIn this exercise, you will create an initial class method to create and attach a new Customer object."},{"Content":"1. Consider the code below and try to explain it.\n\n~~~objectscript\nClassMethod CreateCustomer(\n\tpCustomerNr As %Integer,\n\tpName As %String,\n\tpStreet As %String,\n\tpPostcode As %Integer,\n\tpCity As %String,\n\tOutput PId As %Integer) As %Status\n{\n    #dim tCustomer as Training.Customer = ..%New()\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n        set tCustomer.CustomerNr = pCustomerNr\n        set tCustomer.Name = pName\n        set tCustomer.Address.Street = pStreet\n        set tCustomer.Address.Postcode = pPostcode\n        set tCustomer.Address.City = pCity\n        $$$ThrowOnError(tCustomer.%Save())\n        set pId = tCustomer.%Id()\n    } \n    catch tEx {\n        write !,tEx.DisplayString()\n        set tSc = tEx.AsStatus()\n    }\n\n    return tSc\n}\n~~~","Result":"The method returns the status as return value and the ID of the newly created Customer object via an **_output parameter._** The error handling is done in a **_TRY-CATCH block._** `$$$ThrowOnError(<expression>)` is a **_system macro_** that throws an exception if the evaluation of the expression results in an error condition.\n\nPlease also note the `#dim ...` statements. This is a pseudo declaration that does not create overhead at runtime but supports intellisense."},{"Content":"2. Define the method in your class, save and compile the class and then test the method at the terminal."},{"Content":"## Exercise 5 – Calculated properties and object references\n\nIn this exercise, the model is further completed and the Order and OrderPositions classes are added.\n\nIn addition, Relationships and Object references are introduced and the differences are explained."},{"Content":"1. Create a class **_Training.Order_**. The class should extend **_%Persistent_** and **_%Populate_** and\n\n- a. **_OrderNr_** %Integer\n- b. **_OrderDate_** %Date (MINVAL = 63918)\n- c. **_Customer_** Training.Customer\n\n2. Note that the Customer property refers to the persistent class **_Training.Customer_**. This is an object reference.","Result":"~~~objectscript\nClass Training.Order Extends (%Persistent, %Populate)\n{\n\nProperty OrderNr As %Integer;\n\nProperty OrderDate As %Date(MINVAL = 63918);\n\nProperty Customer As Training.Customer;\n\n}\n~~~"},{"Content":"3. Examine the **_Training.Article_** class in the Class Reference. This class (pre-installed) is needed for the **_Training.OrderPositions_** class that will now be defined.\n4. Create a **_Training.OrderPositions_** class. This class extends **_%Persistent_** and **_%Populate_** and gets first the properties:\n\n- a. **_Article_** Training.Article\n- b. **_Quantity_** %Integer (MINVAL = 1, MAXVAL = 5)\n","Result":"~~~objectscript\nClass Training.OrderPositions Extends (%Persistent, %Populate)\n{\n\nProperty Article As Traing.Article;\n\nProperty Quantity As %Integer (MINVAL = 1, MAXVAL = 5);\n\n}\n~~~"},{"Content":"5. In this step, you define a calculated and SQL-computed property for the row value of this item. Calculated properties have no in-memory representation of the value, but the value is calculated when the property is accessed. To define such a calculated property, the parameters **_Calculated, SqlComputed_** and the property **_SqlComputeCode_** must be defined.\n\nThe property definition thus looks like this:\n\n~~~objectscript\nProperty SumTotal As %Numeric [ Calculated, SqlComputeCode = { set {*} =\n  {Quantity} * ##class(Article).%OpenId({Article}).MarketPrice}, SqlComputed];\n~~~\n\nIn the SqlComputeCode the amount is determined as the product of the Property Quantity * Article MarketPrice. \n\n**_Look at the code and try to explain it._**"},{"Content":"Now, before linking Order and OrderPositions, let's take a closer look at the Customer object reference in the **_Training.Order_** class.\n\n6. Go back to the terminal or restart the terminal from the IRIS Cube.\n7. Create 100 orders with the following command.\n\n```\nTRAINING>write ##class(Training.Order).Populate(100)\n100\n```\n\n8. Check via the System Management Portal that the orders have been created.\n9. Take an order ID and open the associated order object on the terminal\n\n```\nTRAINING>set a = ##class(Training.Order).%OpenId(1)\n```\n\n10. To check that the object has been opened, use the `$isobject(<oref>)` function. This returns 1 if the passing OREF is valid, 0 otherwise.\n\n```\nTRAINING>write $isobject(a)\n1\n```\n\n11. Enter the following\n\n```\nTRAINING>write a.Customer.Name\n```\n\nYou can see the name of the customer. The property Customer is an object reference, and you can directly access properties of the referenced object through the dot syntax.\n\n**The referenced object is implicitly reloaded (swizzled) without you having to open it explicitly.**\n\n12. Change the name of the customer:\n\n```\nTRAINING>set a.Customer.Name = \"Mueller, Heinz\"\n```\n\n13. Save the Order\n\n```\nTRAINING>write a.%Save()\n1\n```\n\n14. In the System Management Portal, check the names in the customer table. **_Has the name been changed?_**","Result":"IRIS has changed the customer’s name in the database, although you have \"only\" saved the order. However, since the customer object was opened via the order and was still referenced by the order, when you save the referencing object, all changes in the referenced objects are also saved. This behavior is called **_Deep Save_** and **_Deep Save_** is the default when saving. \n\nSee the documentation for more options on %Save()."},{"Content":"15. **_How can you get the id of the customer starting from the order?_**","Result":"???"},{"Content":"## Exercise 6 – Relationships\n\nIn this exercise, you will link the **_Training.Order_** and **_Training.OrderPositions_** classes. A parent-child relationship is used for linking because this is a dependent relationship. Relationships in IRIS are\nbidirectional relationships. In each of the classes involved there is a property that represents the relationship. Since all relationships in IRIS are 1:N relationships, a property points to the 1 side and a property points to the N side."},{"Content":"1. In the class Training.Order a property Positions is defined. **_Does this property point to the 1 side or the N side?_**","Result":"The N side"},{"Content":"2. In the Training.OrderPositions class, a property Order is defined. **_What cardinality does it have, 1 or N?_**","Result":"1"},{"Content":"3. Define the property positions in the Training.Order class as follows\n\n~~~objectscript\nRelationship Positions As Training.OrderPositions(POPSPEC = \":3\") \n\t[ Cardinality = children, Inverse = Order ];\n~~~\n\n4. In the Training.OrderPositions class, the counterpart looks like this:\n\n~~~objectscript\nRelationship Order As Training.Order \n\t[ Cardinality = parent, Inverse = Positions ];\n~~~\n\n5. Save and compile the classes."},{"Content":"### Excursus – Storage\n\nWhen persistent classes are compiled successfully for the first time, a storage definition is added to them. This is visible in the class definition.\n\n~~~objectscript\nStorage Default\n{\n‹Data name=\"OrderDefaultData\"≥\n<Value name=\"1\">\n<Value>%%CLASSNAME</Value>\n</Value>\n<Value name=\"2\">\n<Value>OrderNr</Value>\n</Value>\n<Value name=\"3\">\n<Value>OrderDate</Value>\n</Value>\n<Value name=\"4\">\n<Value>Customer</Value>\n</Value>\n</Data>\n<Datalocation>^Training.OrderD</DataLocation>\n<DefaultData>OrderDefaultData</DefaultData>\n‹Idlocation>^Training.OrderD</IdLocation>\n‹IndexLocation>^Training.OrderI</IndexLocation>\n‹StreamLocation>^Training.OrderS</Streamlocation>\n<Type>Storage.Persistent</Type>\n｝\n~~~\n\nThe storage definition describes in which global `<DataLocation>` and at which location in the global the values of the individual properties are stored. If the class definition contains indices or streams, `<IndexLocation>` and `<StreamLocation>` specify the globals where the corresponding data is stored.\n\nThe storage definition is automatically updated when the class definition is modified. Manual changes to the storage definition should **ONLY** be made in justified exceptional cases.\n\n**In the case of classes for which data already exists, the storage definition must not be deleted under any circumstances. This can lead to the data no longer being accessible in the desired form and the original storage definition may have to be laboriously restored!**"},{"Content":"1. Look at the **`<DataLocation>`** in the **Training.Order** and **Training.OrderPositions** classes.\n2. The objects for both classes would currently each be stored in their own global. This isbecause both classes were compiled when the relationship between the two classes was not yet defined. In a parent/child relationship, by default the children are stored in the same global as the parent. To achieve this here, you need to delete the storage definition in both class definitions. Here, this can be done without any problems, since we are still in the development cycle and the data is at most test data that can be recreated.\n3. Delete the storage definition in both class definitions and save and compile the classes again.\n4. Look at the storage definitions again. **Has anything changed?**\n\nThis completes our model for now. In the following exercises we will generate data for the complete model and then work with the data."},{"Content":"## Exercise 7 – Filling the model with data\n\nSince our classes all inherit from **_%Populate,_** they support the data generator in InterSystems IRIS.\n\nIn this exercise we write a class **_Training.Main_** and in this class we implement a method **_setup()_** which can be used to do a reset of the data and rebuild the test data."},{"Content":"1. Create a class **_Training.Main_** and define it as **_Abstract_**. **_What does Abstract mean in this context?_**","Result":"That you can not create an instance of this class."},{"Content":"2. Add a class method **_setup_** to the class with a parameter **_pAmount As %Integer_** and a return type **_%Status_**. In the following figure you can see an example of a skeleton of this method.\n\n~~~objectscript\nClassMethod setup(pAmount As %Integer) As %Status\n{\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n\t// TODO\n    }\n    catch tEx {\n        write !,tEx.DisplayString()\n        set tSc = tEx.AsStatus()    \n    }\n\n    return tSc\n}\n~~~"},{"Content":"3. The next step is to add code for filling the model with data. Our method should also perform a cleanup of any existing data before creating it. For this we use the **_%KillExtent()_** method.\n\n**_CAUTION!!! %KillExtent()_** does not take into account any constraints that may be present and should therefore only be executed in the context of development work. For deleting data in production environments other methods are available. These are the methods %DeleteId(...) or also a delete ... from ... as SQL statement.\n\n4. Implement the **_setup()_** method by applying the **_%KillExtent()_** and **_Populate()_** methods for the classes. Note that there are dependencies between the classes that affect the order of the Populate calls. For example, the order class contains a reference to the customer class and in order for this reference to be populated correctly, the populate for the customer class must occur before the populate for the order class. Other dependencies exist between OrderPositions and Article and Order and OrderPositions. **_What is the correct sequence to ensure that the model is completely filled with data?_**","Result":"~~~objectscript\nClassMethod setup(pAmount As %Integer) As %Status\n{\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n        $$$ThrowOnError(##class(Training.Order).%KillExtent())\n        $$$ThrowOnError(##class(Training.OrderPositions).%KillExtent())\n        $$$ThrowOnError(##class(Training.Customer).%KillExtent())\n        $$$ThrowOnError(##class(Training.Article).%KillExtent())\n        set tAmountCustomer = ##class(Training.Customer).Populate(pAmount * 10)\n        set tAmountArticle = ##class(Training.Article).Populate(10)\n        set tAmountOrder = ##class(Training.Order).Populate(pAmount)\n        set tAmountPositions = ##class(Training.OrderPositions).Populate(pAmount)\n        write !,tAmountCustomer,\" customers created!\"\n        write !,tAmountArticle,\" articles created!\"\n        write !,tAmountOrder,\" orders created!\"\n        write !,tAmountPositions,\" order positions created!\"\n\n    }\n    catch tEx {\n        write !,tEx.DisplayString()\n        set tSc = tEx.AsStatus()    \n    }\n\n    return tSc\n}\n~~~"},{"Content":"5. Execute the **_setup()_** method with an amount of 100.\n6. Look at the data in the System Management Portal via SQL. \n7. Form an SQL join that displays the associated OrderPositions for an order.","Result":"???"},{"Content":"## Exercise 8 – Objects and Relationships\n\nRelationships are accessible via SQL like foreign key relationships. But how can relations be handled via object access?\n\nAs already mentioned, relationships in IRIS are bidirectional relationships. In each of the involved classes there is a property that represents the relationship. We have also already seen that there are two different classes of cardinalities. One/Parent and Many/Children.\n\nIf the cardinality is One/Parent, the object access can be done as with a simple object reference. Also, the Swizzling mechanism works as usual.\n\nIf the cardinality is Many/Children, the relationship property behaves like a collection property and the collection interface is used for access."},{"Content":"1. Determine a valid Orders object ID via SQL\n2. Open the corresponding Orders object with the %OpenId() method\n3. **_Which method can you use to determine the number of positions for this order?_** Use the Class Reference to find the method.","Result":"???"},{"Content":"4. **_Which methods can you use to add an order position?_**","Result":"???"},{"Content":"5. Create a new order position and link it to the order. **_What are the two ways to do this?_**","Result":"???"},{"Content":"## Exercise 9 – Instancemethod\n\n1. Create an instance method **_ListPositions_** in the class **_Training.Order_** , which outputs the individual positions with Article name, Quantity, MarketPrice, Total amount via the object access.\n2. Test the method in the terminal.","Hint":"You can use this skeleton:\n\n~~~objectscript\nMethod ListPositions()\n{\n   \n    #dim tEx as %Exception.SystemException\n\n    try {\n        for i=1:1:..Positions.Count() {\n            // TODO\n        }\n\n    }\n    catch tEx {\n        write !, tEx.DisplayString()\n    }\n}\n~~~","Result":"~~~objectscript\nMethod ListPositions()\n{\n   \n    #dim tEx as %Exception.SystemException\n\n    try {\n        for i=1:1:..Positions.Count() {\n            set tPos = ..Positions.GetAt(i)\n            write !,tPos.Article.ArticleDescription,\" \",tPos.Quantity,\" \",tPos.Article.MarketPrice,\" \",tPos.SumTotal\n        }\n\n    }\n    catch tEx {\n        write !, tEx.DisplayString()\n    }\n}\n~~~"},{"Content":"## Exercise 10 – Retrieve the order data\n\n1. In the **_Training.Main_** class, write a class method **_GetOrderData(pId As %Integer)_** that gets the order data consisting of\n\n- a. customer name\n- b. City of the customer\n- c. Order date\n- d. List of order positions\n\nis displayed. The method is passed the ID of the order and returns the status.\n\n2. Compile and test the method.","Hint":"After the call of **_%OpenId(pId,,.tSc)_** the status will be saved in the tSc variable.","Result":"~~~objectscript\nClassMethod GetOrderData(pId As %Integer) As %Status\n{\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n        set tOrder = ##class(Training.Order).%OpenId(pId,,.tSc)\n        $$$ThrowOnError(tSc)\n        write !,\"Customer: \",tOrder.Customer.Name,\" \",tOrder.Customer.Address.City\n        write !,\"OrderDate: \",tOrder.OrderDateLogicalToDisplay(tOrder.OrderDate)\n        do tOrder.ListPositions()\n    }\n    catch tEx {\n        write !,tEx.DisplayString()\n\n    }\n\n    return tSc\n}\n~~~"},{"Content":"3. **_What stands out about the order date?_**","Result":"???"},{"Content":"4. **_How can you display the date in a readable format?_**","Result":"???"},{"Content":"## Exercise 11 – Class Queries and %SQL.* classes\n\nIn the following exercises you will get to know different classes of SQL queries. A distinction is made between static and dynamic SQL. The static SQL can be defined as a class query or used as embedded SQL directly in ObjectScript."},{"Content":"In this exercise, we will start with class queries.\n\n1. Define in the class **Training.Order** a query **OrderAndCustomer** as shown below:\n\n~~~objectscript\nQuery OrderAndCustomer() As %SQLQuery [ SqlProc ]\n{\n    select OrderDate, OrderNr, Customer->Name,Customer->Address_City from Training.Order\n}\n~~~\n\n2. **_What do the Customer->Name and Customer->Address_City elements in the select list mean?_**\n3. Save and compile the Order class.","Result":"???"},{"Content":"To execute the class, classes from the **_%SQL_** package are needed.\n\n4. Look at the **_%SQL.Statement_** , **_%SQL.StatementResult_** and **_%SQL.StatementMetadata_** in the Class Reference. **_What methods are needed to execute a class query?_**","Result":"???"},{"Content":"5. In the **_Training.Main_** class, implement a **_RunClassQuery_** class method that executes the **_OrderAndCustomer_** query and displays the results.\n6. Test the method.","Hint":"You can use **`tStmnt.%PrepareClassQuery(\"Training.Order\",\"OrderAndCustomer\")`** to call the class query, where _tStmnt_ is an object of type **_%SQL.Statement_**.","Result":"~~~objectscript\nClassMethod RunClassQuery(pId As %Integer) As %Status\n{\n    #dim tStmnt as %SQL.Statement\n    #dim tRs as %SQL.StatementResult\n    #dim tMeta as %SQL.StatementMetadata\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n        set tStmnt = ##class(%SQL.Statement).%New()\n        set tStmnt.%SelectMode = 1\n        $$$ThrowOnError(tStmnt.%PrepareClassQuery(\"Training.Order\",\"OrderAndCustomer\"))\n        set tRs = tStmnt.%Execute()\n        set tMeta = tRs.%GetMetadata()\n\n        write !\n        for i=1:1:tMeta.columnCount {\n            write tMeta.columns.GetAt(i).colName,$c(9)\n        }\n        write !\n        while tRs.%Next() {\n            write !\n            for i=1:1:tMeta.columnCount {\n                write tRs.%GetData(i),$c(9)\n            }\n        }\n        set tRs = \"\"\n        set tStmnt = \"\"\n        set tMeta = \"\"\n\n    }\n    catch tEx {\n        do tEx.DisplayString()\n        set tSc = tEx.AsStatus()\n    }\n\n    return tSc\n}\n~~~"},{"Content":"7. **_What does the statement set tStmnt.%SelectMode = 1 do?_**","Result":"???"},{"Content":"8. Modify the query and the method so that you can use the ID of the order to restrict the result.","Hint":"Use a **WHERE** clause.","Result":"~~~objectscript\nQuery OrderAndCustomer(pId As %Integer) As %SQLQuery [ SqlProc ]\n{\n    select OrderDate, OrderNr, Customer->Name,Customer->Address_City from Training.Order\n    where id = :pId\n}\n~~~"},{"Content":"The parameter `pId` is used within the SQL statement as a so-called host variable. To\ndistinguish host variables from field names, host variables are preceded by a colon.\n\nThe current parameter is passed to the query in the %Execute method.\n\n~~~objectscript\nClassMethod RunClassQuery(pId As %Integer) As %Status\n{\n    #dim tStmnt as %SQL.Statement\n    #dim tRs as %SQL.StatementResult\n    #dim tMeta as %SQL.StatementMetadata\n    #dim tSc as %Status = $$$OK\n    #dim tEx as %Exception.SystemException\n\n    try {\n        set tStmnt = ##class(%SQL.Statement).%New()\n        set tStmnt.%SelectMode = 1\n        $$$ThrowOnError(tStmnt.%PrepareClassQuery(\"Training.Order\",\"OrderAndCustomer\"))\n        set tRs = tStmnt.%Execute(pId)\n        set tMeta = tRs.%GetMetadata()\n\n        write !\n        for i=1:1:tMeta.columnCount {\n            write tMeta.columns.GetAt(i).colName,$c(9)\n        }\n        write !\n        while tRs.%Next() {\n            write !\n            for i=1:1:tMeta.columnCount {\n                write tRs.%GetData(i),$c(9)\n            }\n        }\n        set tRs = \"\"\n        set tStmnt = \"\"\n        set tMeta = \"\"\n\n    }\n    catch tEx {\n        do tEx.DisplayString()\n        set tSc = tEx.AsStatus()\n    }\n\n    return tSc\n}\n~~~"},{"Content":"## Exercise 12 – embedded SQL\n\nIn this exercise, embedded SQL is used to execute static queries. A distinction must be made here between cursor-based SQL and non-cursor-based SQL.\n\nWe start with the SQL statement from exercise 11. Embedded SQL now means that the SQL\nstatement can be embedded in ObjectScript. To do this, the SQL statement must be syntactically embedded in `&sql(<SQL statement>)`. Host variables play an important role in embedded SQL. Parameters are passed to the statement in the form of host variables in the same way as in Exercise 11, but the results are also written to host variables in the INTO clause.\n\nThe statement from exercise 11 thus changes to:\n\n~~~objectscript{c}\n&sql(\n  select OrderDate, OrderNr, Customer->Name,Customer->Address_City \n    into :tOrderDate, :tOrderNr, :tCustomerName, :tCustomerCity  \n  from Training.Order\n    where id = :pId\n     )\n~~~"},{"Content":"1. Write a class method with the following signature **_RunEmbeddedSQL(pId as %Integer) as %Status_** in the **_Training.Main_** class. The method should execute the above embedded SQL statement and display the result. Since the query will return at most one result row due to the constraint over the ID, we do not need cursor-based SQL here.","Result":"!!!CODE!!!"},{"Content":"!!!CODE!!!\n\n2. Look at the code. After the SQL statement a variable SQLCODE is used. This variable is set when the SQL statement is executed and indicates whether the execution of the statement was successful (SQLCODE = 0).\n\n**Attention:** If you use an INTO clause in select statements, the host variables in the INTO clause have a defined value only if the SQLCODE = 0.\n\n3. Consider the preprocessor statement **_#SQLCompile Select = ODBC_**. **_What does it do?_**","Result":"???"},{"Content":"## Exercise 13 – Cursor based embedded SQL\n\nIn this exercise, the query from Exercise 12 is modified to require an embedded SQL with cursor to execute."},{"Content":"1. Write a class method with the following signature: **_RunEmbeddedSQLWithCursor() As %Status_** in the class **_Training.Main_**.\n2. Modify the SQL statement from Exercise 12 to remove the WHERE clause.\n3. To define a cursor for embedded SQL, the statement must be preceded by **`declare cursor <cursorname> for`**","Result":"!!!CODE!!!\n\nA cursor with the name ptr is defined here. To be able to use the cursor, the cursor\nmust be opened. After a successful opening (SQLCODE = 0), fetch operations can be\nused to iterate over the result quantity. This is analogous to the %Next() method in theResultSet classes. The fetch operation returns the variable SQLCODE = 0 if there are more result rows. Afterwards the cursor must be closed."},{"Content":"4. Rewrite the method implementation.","Result":"!!!CODE!!!"},{"Content":"Finally, there is the execution of dynamic SQL. In this context, dynamic SQL means that the structure of the SQL statement is defined at runtime. For the execution of dynamic SQL, the %SQL.* classes are used again and the execution is very similar to the execution of class queries (Exercise 11). The difference here is the call to the **_%Prepare_** method. This is used to prepare SQL statements for execution."},{"Content":"## Exercise 14 – Dynamic SQL\n\n1. In the Class Reference, examine the %SQL.Statement class. **_Which methods are necessary to execute a SQL statement?_**","Result":"???"},{"Content":"2. In the Training.Main class, write a class method with the following signature: **_RunDynamicSQL() As %Status_**\n    \nThe method should execute the SQL statement from Exercise 13 (without a declare cursor, of course) and display the results.","Result":"!!!CODE!!!"},{"Content":"3. Save and compile the class and test the method. \n4. Examine the code. What does the statement **`set tStmnt.%SelectMode = 1`**?","Result":"??"},{"Content":"## Exercise 15 – REST Specification First\n\nIn this exercise, you will create a REST service that returns custom data. You will use the Specification First option to create the framework of the REST service from a specification. The REST service will use JSON as the message format. InterSystems IRIS supports JSON inbound and outbound out of the box. Analogous to the XML Support, the **_%JSON.Adaptor_** class is added to the list of super classes for the JSON Support as another superclass."},{"Content":"In addition, there are two more classes that support JSON handling and are very easy and intuitive to use. The two classes are **_%DynamicObject_** and **_%DynamicArray_**. With **_%DynamicObject_** objects can be created on-the-fly without prior class definition and exported to JSON or JSON strings can be received and converted to objects. The same is true for **_%DynamicArray_**.\n\n1. In the terminal, create a dynamic object with **_FirstName, LastName_** , and **_City_** properties and set appropriate values in the properties.\n2. Output this object as JSON.\n","Hint":"Use the **%ToJSON()** method, that returns the a JSON String from a DynamicObject.","Result":"```\nTRAINING>set obj = ##class(%DynamicObject).%New()\nTRAINING>do obj.%Set(\"FirstName\",\"John\")\nTRAINING>do obj.%Set(\"LastName\",\"Smith\")\nTRAINING>do obj.%Set(\"City\",\"London\")\nTRAINING>write obj.%ToJSON()\n{\"FirstName\":\"John\",\"LastName\":\"Smith\",\"City\":\"London\"}\n```"},{"Content":"3. In the Class Reference, load the [documentation](http://localhost:52773/csp/documatic/%25CSP.Documatic.cls?PAGE=CLASS&LIBRARY=%25SYS&CLASSNAME=%25JSON.Adaptor) for **_%JSON.Adaptor_** and familiarize yourself with the JSON Adaptor.\n4. Add **_%JSON.Adaptor_** to the list of super classes in the **_Training.Customer_** and **_Training.Address_** classes.\n5. There is a file API-Spec on your desktop. This file contains a Swagger specification about the REST service you want to implement. Open the file and look at the contents. **_What is the name of the endpoint to be implemented?_**","Result":"???"},{"Content":"6. **_Which http method should be used to call the endpoint?_**","Result":"???"},{"Content":"7. **_Does the endpoint have a parameter?_**","Result":"???"},{"Content":"8. InterSystems IRIS provides a REST API for API management. One of these endpoints can be used to load Swagger specifications and generate the required classes for implementing the REST service in InterSystems IRIS based on the specification.\n\nThe endpoint for this case is:\n[http://localhost:52773/api/mgmnt/v2/TRAINING/Training](http://localhost:52773/api/mgmnt/v2/TRAINING/Training)\n\nThis endpoint specifies as the first parameter the namespace in which the classes should be generated. In our case it is the namespace TRAINING. The second parameter is a name for the application to be generated. In this case also Training.\n\n9. The endpoint is called with the POST method and in the body of the request the Swagger specification is passed."},{"Content":"10. Start Postman.\n11. In the URL input field, enter the above URL and copy the Swagger specification from the file into the body of the request. Select POST as the method.","Result":"!!!BILD!!!"},{"Content":"12. Send the request. You will receive the following response\n\n!!!BILD!!!"},{"Content":"13. The REST request creates three classes on the server.\n\n- **_a. Training.disp.cls_**\n- **_b. Training.spec.cls_**\n- **_c. Training.impl.cls_**\n\nThe Training.disp.cls class serves as the dispatcher. Training.spec.cls contains the\nspecifications and Training.impl.cls the implementation.\n\n14. If you are working with VSCode go into the ObjectScript plugin and export the classes **`Training.*`**.\n15. Look at the generated classes. In the dispatcher class, there is an **_XData_** block **_UrlMap_** that is responsible for forwarding incoming requests. Here you can see that incoming requests for the Customer endpoint are forwarded to the **_GetCustomer_** method. If you look at the implementation of the **_GetCustomer_** method, you can see that the method calls a **GetCustomer** method in the **_Training.impl_** class."},{"Content":"16. Open the **_Training.impl_** class. A **_GetCustomer_** method is already created in the class. The implementation code is still missing.\n17. Implement the **_GetCustomer_** method using the **_%JSON.Adaptor_** class and **_%DynamicObject_**.","Result":"!!!CODE!!!"},{"Content":"To make the REST service available, one more step is missing. A web application must be created in System Management Portal to activate the REST service.\n\n18. Open the System Management Portal from the IRIS Cube.\n19. Go to **_System Administration > Security > Applications > Web Applications_**\n20. Select **_Create new web application._**\n21. In the **_Name_** field please enter **_/api/training/v1_**\n22. In the **_Namespace_** combo box select the namespace **_Training_**\n23. Activate the radio button **_REST._**\n24. In the field Distribution Class enter **_Training.disp_**\n25. Click **_Save_**\n"},{"Content":"The REST service should now be ready for use.\n\n26. Test the service with Postman by entering the following URL\n\n\n[http://localhost:52773/api/training/v1/Customer/2](http://localhost:52773/api/training/v1/Customer/2)\n\n27. Use the GET method.\n28. **_What happens if you enter an invalid ID?_**","Result":"???"}]},{"Title":"Java Introduction","Language":"english","Author":"pbonin","Description":"A java Introduction","IsPrivate":false,"Pages":[{"Content":"![logo](https://upload.wikimedia.org/wikipedia/en/thumb/3/30/Java_programming_language_logo.svg/1200px-Java_programming_language_logo.svg.png){height:300px}\n\n# Install Java\n\n## Windows\n\n1. Download the latest version of Java from [here](https://www.oracle.com/java/technologies/javase-downloads.html).\n2. Run the installer and follow the instructions.\n\n### Linux\n\n1. Open a terminal and run the following command:\n\n```bash\nsudo apt install default-jre\n```\n\n2. Enter your password and press enter.\n3. Wait for the installation to finish.\n\n#### Mac\n\n1. Download the latest version of Java from [here](https://www.oracle.com/java/technologies/javase-downloads.html).\n2. Run the installer and follow the instructions.\n\n"},{"Content":"# Hello World\n\n1. Open a new file in your favorite text editor and save it as `Hello.java`.\n2. Copy the following code into the file:\n\n~~~java\npublic class Hello {\n    public static void main(String[] args) {\n        // TODO\n    }\n}\n~~~\n\n3. Replace the `TODO` so that _\"Hello World\"_ will be printed to the console.\n\ntest\n\n$$$[Download](test1.txt)\n\n\n$$$[Download index](index.html)\n\n$$$[Download impl](impl.cls)","Hint":"Use the `System.out.print` method to print the string _\"Hello World\"_ to the console.","Result":"_Hello.java_:\n\n~~~java\npublic class Hello {\n    public static void main(String[] args) {\n        System.out.print(\"Hello World\");\n    }\n}\n~~~\n"},{"Content":"# Using string variables\n\nYou can define a variable by assigning a value to it. The variable name is on the left of the assignment operator `=` and the value is on the right.\n\n~~~java\nString name = value;\n~~~\n\nDefine a variable called `name` and assign it the value `\"John\"` and then print it to the console.\n\nztest\n\n$$$[Download](hallo.ts)","Result":"~~~java\nString name = \"John\";\nSystem.out.print(name);\n~~~"}]}]